Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Whenever your endpoint methods return an object (of when they return a link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] or link:{jaxrsapi}/javax/ws/rs/core/Response.html[`Response`] with an entity), RESTEasy Reactive will look for a way to map that into an HTTP response body.
ja_jp: エンドポイントメソッドが（link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] もしくはエンティティの link:{jaxrsapi}/javax/ws/rs/core/Response.html[`Response`] を返し）オブジェクトを返すときはいつでも、RESTEasy Reactive は、それを HTTP レスポンスボディにマップする方法を探します。

source: Whenever your endpoint methods return an object (or when they return a link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] or link:{jaxrsapi}/jakarta/ws/rs/core/Response.html[`Response`] with an entity), Quarkus REST will look for a way to map that into an HTTP response body.
ja_jp: エンドポイントメソッドがオブジェクトを返すとき (または link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] またはエンティティー付きの link:{jaxrsapi}/jakarta/ws/rs/core/Response.html[`Response`] を返す場合)、Quarkus REST は、オブジェクトなどを HTTP レスポンス本文にマッピングする方法を探します。

source: Where `+${RJMX_PORT}+` is replaced with your chosen port number for the remote JMX network connection over RMI. In this example we disable JMX authentication and JMX SSL - in practice these should both be enabled for security reasons, but configuring these particular options is out of scope for this guide. Please see https://docs.oracle.com/javadb/10.10.1.2/adminguide/radminjmxenablepwdssl.html[this document^] for further information.
ja_jp: ここで、 `${RJMX_PORT}` は、RMIを介したリモートJMXネットワーク接続のために選択したポート番号に置き換えられています。この例では、JMX認証とJMX SSLを無効にしています。実際には、セキュリティ上の理由からこれらは両方とも有効にすべきですが、これらの特定のオプションを構成することは、このガイドの範囲外です。詳細については、 link:https://docs.oracle.com/javadb/10.10.1.2/adminguide/radminjmxenablepwdssl.html[このドキュメントを, window=_blank]参照してください。

source: Where `InMemorySpanExporter` is a class from the OpenTelemetry test utilities dependency:
ja_jp: ここで、`InMemorySpanExporter` は OpenTelemetry テストユーティリティーの依存関係からのクラスです。

source: Where `UPPERCASED_AND_UNDERSCORED_PLATFORM_KEY` is a platform key with each character converted to uppercase and a `.` replaced with `_`. For example, `IO_QUARKUS_PLATFORM`.
ja_jp: ここで、`UPPERCASED_AND_UNDERSCORED_PLATFORM_KEY` は、各文字が大文字に変換され、`．` が `_` に置き換えられたプラットフォームキーです。例えば、`IO_QUARKUS_PLATFORM` となります。

source: Where are the Quarkus Extension Codestarts located
ja_jp: Quarkus Extension の Codestart はどこにありますか？

source: Where are the config files?
ja_jp: 設定ファイルはどこにありますか？

source: Where are the plugins added?
ja_jp: プラグインはどこに追加されるのですか？

source: Where can I get it?
ja_jp: どこから入手できますか?

source: Where can we find this API?
ja_jp: このAPIはどこにありますか?

source: Where extensions use an external service, adding a Dev Service can improve the user experience in development and test modes. See xref:extension-writing-dev-service.adoc[how to write a Dev Service] for more details.
ja_jp: エクステンションが外部サービスを使用する場合、Dev Service を追加すると、開発モードとテストモードでのユーザーエクスペリエンスが向上します。 詳細は、xref:extension-writing-dev-service.adoc[Dev Service の記述方法] を参照してください。

source: Where in this example, the `${provider-name}` is `auth0`
ja_jp: この例では、 `${provider -name}` は `auth0` です

source: Where is 2.2.0.Final?
ja_jp: 2.2.0.Finalはどこに？

source: Where is Kogito?
ja_jp: Kogitoはどこですか？

source: Where is my 1.10.0.Final (and my 1.10.1.Final)?!?
ja_jp: 1.10.0.Final(と1.10.1.Final)はどこにあるの!?

source: Where the `SimpleBeanParam` class is declared like in the example below:
ja_jp: `SimpleBeanParam` クラスは以下の例のように宣言されています。

source: Where the `keycloak.version` is set to version `26.1.3` or later.
ja_jp: `keycloak.version` がバージョン `26.1.3` 以降に設定されている場合。

source: Where to go from here
ja_jp: 今後の展開

source: Where you can then check Grafana's datasource API for existing metrics data.
ja_jp: その後、Grafana のデータソース API で既存のメトリクスデータを確認できます。

source: Where:
ja_jp: 以下の場合:

source: Whether AMQP subscription is durable Type: _boolean_
ja_jp: AMQP サブスクリプションが永続的であるかどうか タイプ: _boolean_

source: Whether Kafka client is created lazily or eagerly. Type: _boolean_
ja_jp: Kafkaクライアントを遅延作成するか(lazy)、即時作成するか(eagerly)。 Type: _boolean_

source: Whether OpenTelemetry is enabled or not. The default is `true`, but shown here to indicate how it can be disabled
ja_jp: OpenTelemetryを有効にするかどうか。デフォルトは `true` ですが、ここでは無効にできることを示しています。

source: Whether Quarkus should use the online registry to resolve extension catalogs. If this is set to false, the extension catalog will be narrowed to the defined (or default) platform BOM.
ja_jp: Quarkus がオンラインレジストリーを使用して拡張カタログを解決するかどうか。これが false に設定されている場合、拡張カタログは、定義された (またはデフォルトの) プラットフォーム BOM に絞り込まれます。

source: Whether a graceful shutdown should be attempted when the application terminates. Type: _boolean_
ja_jp: アプリケーションの終了時に、グレースフルシャットダウンを行うかどうか。 Type: _boolean_

source: Whether all entities are removed from the indexes before indexing.
ja_jp: インデックスの作成前に、すべてのエンティティーがインデックスから削除されるかどうか。

source: Whether automatic connection recovery is enabled Type: _boolean_
ja_jp: 自動接続回復が有効にかどうか Type: _boolean_

source: Whether automatic recovery on initial connections is enabled Type: _boolean_
ja_jp: 初期接続での自動回復が有効かどうか Type: _boolean_

source: Whether batch receive is used to consume messages
ja_jp: バッチ受信を使用してメッセージを消費するかどうか

source: Whether each index is merged into a single segment after indexing.
ja_jp: インデックスの作成後に各インデックスが 1 つのセグメントにマージされるかどうか。

source: Whether each index is merged into a single segment after the initial index purge, just before indexing.
ja_jp: インデックスの作成直前に、最初のインデックスのパージ後に各インデックスが 1 つのセグメントにマージされるかどうか。

source: Whether health reporting is enabled (default) or disabled
ja_jp: ヘルスレポートが有効（デフォルト）か無効か

source: Whether health reporting is enabled (default) or disabled Type: _boolean_
ja_jp: ヘルスレポートが有効（デフォルト）か無効か Type: _boolean_

source: Whether or not Quarkus should use the online registry to resolve extension catalogs. If this is set to false, the extension catalog will be narrowed to the defined (or default) platform BOM.
ja_jp: Quarkusがオンラインレジストリを使用してエクステンションカタログを解決するかどうかを指定します。これをfalseに設定すると、エクステンションカタログは定義された（またはデフォルトの）プラットフォームBOMに絞り込まれます。

source: Whether or not a graceful shutdown should be attempted when the application terminates. Type: _boolean_
ja_jp: アプリケーションの終了時にグレースフルシャットダウンを試みるかどうか。 Type: _boolean_

source: Whether or not the connection should use SSL Type: _boolean_
ja_jp: 接続にSSLを使用するかどうか Type: _boolean_

source: Whether or not the connection to the broker is re-attempted in case of failure Type: _boolean_
ja_jp: 障害発生時にブローカーへの接続を再試行するかどうか Type: _boolean_

source: Whether or not the connector should insert automatically the `time` attribute into the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `time` attribute itself Type: _boolean_
ja_jp: コネクタが `time` 属性を発信クラウドイベントに自動的に挿入するかどうか。 `cloud-events` が `true` に設定されている必要があります。 この値は、メッセージが `time` 属性自体を構成していない場合に使用されます。 Type: _boolean_

source: Whether or not the connector should use an anonymous sender. Default value is `true` if the broker supports it, `false` otherwise. If not supported, it is not possible to dynamically change the destination address. Type: _boolean_
ja_jp: コネクタが匿名送信者を使用するかどうか。デフォルト値は、ブローカーがサポートしている場合は `true` で、それ以外は `false` です。サポートされていない場合、宛先アドレスを動的に変更することはできません。 Type: _boolean_

source: Whether readiness health reporting is enabled (default) or disabled Type: _boolean_
ja_jp: レディネスレポートが有効（デフォルト）か無効か Type: _boolean_

source: Whether sent AMQP messages are marked durable Type: _boolean_
ja_jp: 送信された AMQP メッセージが耐久性があるとマークされているかどうか タイプ: _boolean_

source: Whether the AMQP connection uses SSL/TLS Type: _boolean_
ja_jp: AMQP 接続が SSL/TLS を使用するかどうか タイプ: _boolean_

source: Whether the Kafka records are consumed in batch. The channel injection point must consume a compatible type, such as `List<Payload>` or `KafkaRecordBatch<Payload>`. Type: _boolean_
ja_jp: Kafka レコードがバッチで消費されるかどうか。チャネルインジェクションポイントは、 `List<Payload>` または `KafkaRecordBatch<Payload>` などの互換性のあるタイプを消費する必要があります。 Type: _boolean_

source: Whether the Kafka records should be dispatched to multiple consumer Type: _boolean_
ja_jp: Kafkaレコードが複数のコンシューマーにディスパッチされるべきか Type: _boolean_

source: Whether the client accepts untrusted TLS certificates from the broker.
ja_jp: クライアントがブローカーから信頼されていない TLS 証明書を受け入れるかどうか。

source: Whether the client waits for Kafka to acknowledge the written record before acknowledging the message Type: _boolean_
ja_jp: クライアントがメッセージを確認する前に、Kafkaが書き込まれた記録を確認するのを待つかどうか Type: _boolean_

source: Whether the client waits for the broker to acknowledge the written record before acknowledging the message
ja_jp: 顧客がメッセージを確認する前に、ブローカーが書かれたレコードを確認するのを待つかどうか。

source: Whether the connection should use SSL Type: _boolean_
ja_jp: 接続で SSL を使用するかどうか Type: _boolean_

source: Whether the connection to the broker is re-attempted in case of failure Type: _boolean_
ja_jp: 障害発生時にブローカーへの接続を再試行するかどうか Type: _boolean_

source: Whether the connector should allow multiple upstreams Type: _boolean_
ja_jp: コネクタが複数のアップストリームを許可するかどうか タイプ: _boolean_

source: Whether the connector should insert automatically the `time` attribute into the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `time` attribute itself Type: _boolean_
ja_jp: コネクターが、送信するクラウドイベントに自動的に `time` 属性を挿入するかどうかを指定します。 `cloud-events` が `true` に設定されていることが必要です。この値は、メッセージに `time` 属性が設定されていない場合に使用されます。 タイプ: _boolean_

source: Whether the connector should use an anonymous sender. Default value is `true` if the broker supports it, `false` otherwise. If not supported, it is not possible to dynamically change the destination address. Type: _boolean_
ja_jp: コネクターが匿名送信者を使用するかどうか。デフォルト値は、ブローカーがサポートしている場合は `true` で、それ以外の場合は `false` です。サポートしていない場合は、宛先アドレスを動的に変更することができません。 タイプです。 タイプ: _boolean_

source: Whether the connector should use an anonymous sender. The default value is `true` if the broker supports it, `false` otherwise. If not supported, it is not possible to dynamically change the destination address. Type: _boolean_
ja_jp: コネクターが匿名送信者を使用するかどうか。デフォルト値は、ブローカーがサポートしている場合は `true` 、そうでない場合は `false` です。サポートされていない場合、送信先アドレスを動的に変更することはできません。 Type: _boolean_

source: Whether the exchange is durable Type: _boolean_
ja_jp: エクスチェンジが耐久性があるかどうか Type: _boolean_

source: Whether the exchange should be deleted after use Type: _boolean_
ja_jp: 使用後にエクスチェンジを削除する必要があるかどうか Type: _boolean_

source: Whether the hostname is validated when the client creates a TLS connection with brokers.
ja_jp: クライアントがブローカーとTLS接続を作成するときにホスト名を検証するかどうか。

source: Whether the indexes and their schema (if they exist) should be dropped and re-created before indexing.
ja_jp: インデックスの作成前に、インデックスとそのスキーマ (存在する場合) を削除して再作成するかどうか。

source: Whether the polling must be paused when the application does not request items and resume when it does. This allows implementing back-pressure based on the application capacity. Note that polling is not stopped, but will not retrieve any records when paused. Type: _boolean_
ja_jp: アプリケーションがアイテムを要求しないときにポーリングを一時停止し、要求したときに再開する必要があるかどうか。これにより、アプリケーションの容量に基づいてバックプレッシャを実装できます。ポーリングは停止されませんが、一時停止されたときにレコードを取得しないことに注意してください。 Type: _boolean_

source: Whether the queue is durable Type: _boolean_
ja_jp: キューに耐久性があるかどうか Type: _boolean_

source: Whether the queue is for exclusive use Type: _boolean_
ja_jp: キューが専用かどうか Type: _boolean_

source: Whether the queue should be deleted after use Type: _boolean_
ja_jp: 使用後にキューを削除する必要があるかどうか Type: _boolean_

source: Whether the received AMQP messages must be acknowledged when received Type: _boolean_
ja_jp: 受信した AMQP メッセージを受信時に確認する必要があるかどうか タイプ: _boolean_

source: Whether the received AMQP messages must be dispatched to multiple _subscribers_ Type: _boolean_
ja_jp: 受信した AMQP メッセージを複数の _subscribers_ にディスパッチする必要があるかどうか タイプ: _boolean_

source: Whether the received RabbitMQ messages must be acknowledged when received; if true then delivery constitutes acknowledgement Type: _boolean_
ja_jp: 受信した RabbitMQ メッセージを受信時に確認する必要があるかどうか。true の場合、配信は確認されます。 Type: _boolean_

source: Whether the received RabbitMQ messages must be dispatched to multiple _subscribers_ Type: _boolean_
ja_jp: 受信した RabbitMQ メッセージを複数の _サブスクライバー_ にディスパッチする必要があるかどうか Type: _boolean_

source: Whether the startup and readiness check should verify that topics exist on the broker. Default to false. Enabling it requires an admin client connection. Type: _boolean_
ja_jp: ブローカーにトピックが存在するかどうかをスタートアップおよび レディネスチェックで確認するかどうか。デフォルトは false です。これを有効にするには、admin 接続が必要です。 Type: _boolean_

source: Whether to automatically acknowledge pending chunked messages when the threshold of `maxPendingChunkedMessage` is reached. If set to `false`, these messages will be redelivered by their broker.
ja_jp: `maxPendingChunkedMessage` のしきい値に達したときに、保留中のチャンク・メッセージを自動的に承認するかどうか。 `false` に設定すると、これらのメッセージはブローカによって再配信されます。

source: Whether to automatically declare the DLQ and bind it to the binder DLX Type: _boolean_
ja_jp: DLQ を自動的に宣言し、それをバインダー DLX にバインドするかどうか Type: _boolean_

source: Whether to declare the dead letter exchange binding. Relevant only if auto-bind-dlq is true; set to false if these are expected to be set up independently Type: _boolean_
ja_jp: デッドレターエクスチェンジバインディングを宣言するかどうか。auto-bind-dlq が true の場合にのみ関連します。これらが独立して設定されることが予想される場合は、false に設定します。 Type: _boolean_

source: Whether to declare the exchange; set to false if the exchange is expected to be set up independently Type: _boolean_
ja_jp: エクスチェンジを宣言するかどうか。エクスチェンジが独立して設定されることが予想される場合は、false に設定します。 Type: _boolean_

source: Whether to declare the queue and binding; set to false if these are expected to be set up independently Type: _boolean_
ja_jp: キューとバインディングを宣言するかどうか。これらが独立して設定されることが予想される場合は、false に設定します Type: _boolean_

source: Whether to discard old messages instead of recent ones Type: _boolean_
ja_jp: 最近のメッセージではなく古いメッセージを破棄するかどうか Type: _boolean_

source: Whether to enable BusyWait for EpollEventLoopGroup.
ja_jp: EpollEventLoopGroupのBusyWaitを有効にするかどうか。

source: Whether to enable transaction.
ja_jp: トランザクションを有効にするかどうか。

source: Whether to include properties when a broker message is passed on the event bus Type: _boolean_
ja_jp: ブローカーメッセージがイベントバスで渡されるときにプロパティーを含めるかどうか Type: _boolean_

source: Whether to keep a trailing slash in the audience value
ja_jp: オーディエンス値の末尾のスラッシュを保持するかどうか

source: Whether to skip trust certificate verification Type: _boolean_
ja_jp: 信頼証明書の検証を省略するかどうか Type: _boolean_

source: Whether to use TCP NoDelay option.
ja_jp: TCP NoDelayオプションを使用するかどうか。

source: Whether to use TLS.
ja_jp: TLSを使用するかどうか。

source: Whether tracing is enabled (default) or disabled
ja_jp: トレースが有効（デフォルト）か無効か

source: Whether tracing is enabled (default) or disabled Type: _boolean_
ja_jp: トレースを有効（デフォルト）にするか、無効にするか Type: _boolean_

source: Whether usage of NIO Sockets is enabled Type: _boolean_
ja_jp: NIO ソケットの使用が有効かどうか Type: _boolean_

source: Whether you need to explicitly acknowledge the message depends on the `auto-acknowledgement` setting for the channel; if that is set to true then your message will be automatically acknowledged on receipt.
ja_jp: メッセージを明示的に確認する必要があるかどうかは、チャネルの `auto-acknowledgement` により異なります。これが true に設定されている場合、メッセージは受信時に自動的に確認されます。

source: Whether you use Maven or Gradle, the code generation goals/tasks are automatically executed when using the default lifecycle of the plugins.
ja_jp: Maven または Gradle のどちらを使用する場合でも、プラグインのデフォルトライフサイクルを使用すると、コード生成のゴール/タスクが自動的に実行されます。

source: Whether you use dynamic or typesafe, the result should be the same. If the JSON document is hard to read, you might want to run it through a tool that formats it for better readability by humans, for example by piping the output through `jq`.
ja_jp: dynamic と typesafe のどちらを使用しても、結果は同じです。JSONドキュメントが読みにくい場合は、人間が読みやすいようにフォーマットしてくれるツールに通したほうがいいかもしれません。たとえば、出力を `jq` に通してみてはいかがでしょうか。

source: Whether you're a developer exploring your project or an extension author enhancing the experience, Dev UI is your entry point.
ja_jp: プロジェクトを探索する開発者であろうと、エクスペリエンスを強化するエクステンション作成者であろうと、Dev UI はあなたの入り口となります。

source: Which extends the `PanacheRepository` interface, with the entity in question as type parameter
ja_jp: `PanacheRepository` インターフェースを拡張し、問題のエンティティを型パラメーターとして持つ

source: Which is more often than not caused by Quarkus initializing at build time a class with a static `Random`/`SplittableRandom` field, causing this particular instance to be tentatively included in the image heap.
ja_jp: これは、Quarkus がビルド時に静的な `Random`/`SplittableRandom` フィールドを持つクラスを初期化し、この特定のインスタンスがイメージヒープに一時的に含まれることが原因である場合がほとんどです。

source: Which means IntelliJ IDEA consumes 281,8 MB of resident memory.
ja_jp: つまり、IntelliJ IDEAは281,8MBのRSSを消費していることになります。

source: Which means that anything attempting to load something from the classpath will trigger JAR files to be opened (the first time they are accessed), and then read from disk.
ja_jp: つまり、クラスパスから何かをロードしようとする試みはすべて、JAR ファイルを開き (最初にアクセスされたとき)、ディスクから読み取る動作をトリガーすることになります。

source: Which works best depends on your priorities, constraints, and application workload.
ja_jp: どれが最適かは、あなたの優先事項、制約、およびアプリケーションのワークロードによって異なります。

source: Whichever user you choose, no password is required.
ja_jp: どちらのユーザーを選択しても、パスワードは必要ありません。

source: While 1.13.2.Final is a maintenance release, we had some users asking for a backport of the brand new Oracle JDBC driver extension.
ja_jp: 1.13.2.Finalはメンテナンスリリースですが、新しいOracle JDBCドライバエクステンションのバックポートを求める声がありました。

source: While JBoss Logging routes log messages directly to the JBoss Log Manager, one of your libraries might rely on a different logging API. In such cases, you need to use a <<logging-apis,logging adapter>> to ensure that its log messages are routed to JBoss Log Manager as well.
ja_jp: JBoss Logging はログメッセージを直接 JBoss Log Manager にルーティングしますが、ライブラリーの 1 つが別のロギング API に依存している場合があります。そのような場合は、 <<logging-apis,ロギングアダプター>> を使用して、そのログメッセージも JBoss Log Manager にルーティングされるようにする必要があります。

source: While JBoss Logging routes log messages into JBoss Log Manager directly, one of your libraries might rely on a different logging API. In such cases, you need to use a <<logging-apis,logging adapter>> to ensure that its log messages are routed to JBoss Log Manager as well.
ja_jp: JBoss Logging はログメッセージを直接 JBoss Log Manager にルーティングしますが、ライブラリーの 1 つが別のロギング API に依存している場合があります。 このような場合、 xref:logging-apis[ログアダプター] を使用して、そのログメッセージが JBoss Log Manager にもルーティングされるようにする必要があります。

source: While JBoss Logging routes log messages into JBoss Log Manager directly, one of your libraries might rely on a different logging API. In such cases, you need to use a xref:logging-apis[logging adapter] to ensure that its log messages are routed to JBoss Log Manager as well.
ja_jp: JBoss Logging はログメッセージを直接 JBoss Log Manager にルーティングしますが、ライブラリーの 1 つが別のロギング API に依存している場合があります。このような場合、 xref:logging-apis[ログアダプター] を使用して、そのログメッセージが JBoss Log Manager にもルーティングされるようにする必要があります。

source: While PKCE is of primary importance to public OIDC clients, such as SPA scripts running in a browser, it can also provide extra protection to Quarkus OIDC `web-app` applications. With PKCE, Quarkus OIDC `web-app` applications act as confidential OIDC clients that can securely store the client secret and use it to exchange the code for the tokens.
ja_jp: PKCE は、ブラウザーで実行される SPA スクリプトなどのパブリック OIDC クライアントにとって最も重要ですが、Quarkus OIDC `web-app` アプリケーションに追加の保護を提供することもできます。 PKCE を使用すると、Quarkus OIDC `web-app` アプリケーションは、クライアントシークレットを安全に保存し、それを使用してトークンのコードを交換できる機密 OIDC クライアントとして機能します。

source: While Quarkus 3.33 is a Long Term Support (LTS) release, branched from Quarkus 3.32 and maintained for 12 months, Quarkus 3.34 comes with a lot of enhancements across the board: Dev UI, Panache Next, and a lot of other areas got improved.
ja_jp: Quarkus 3.33 は、Quarkus 3.32 から分岐し、12 か月間メンテナンスされる Long Term Support (LTS) リリースですが、 Quarkus 3.34 には、全体的に多くの機能強化が施されています。 Dev UI、Panache Next、その他多くの領域が改善されました。

source: While Quarkus by default runs on port 8080, most Azure services expect web applications to be running on port 80. Before we continue, go back to your quickstart code and open the file `src/main/docker/Dockerfile.native`.
ja_jp: Quarkusはデフォルトではポート 8080 で動作しますが、ほとんどのAzureサービスでは、ウェブアプリケーションがポート 80 で動作することを想定しています。続ける前に、クイックスタートコードに戻り、 `src/main/docker/Dockerfile.native` を開いてください。

source: While Quarkus integrates with build tools such as https://maven.apache.org/[Maven] and https://gradle.org/[Gradle], it could itself be categorized as a build tool with its own component and dependency model, build steps, and build outcomes. One of the essential component types of a Quarkus application is a Quarkus extension, which consists of a runtime and a build time artifacts, and their dependencies.
ja_jp: Quarkus は、 https://maven.apache.org/[Maven] や https://gradle.org/[Gradle] などのビルドツールと連携しますが、Quarkus 自体が独自のコンポーネントと依存関係モデル、ビルドステップ、ビルド出力を持つビルドツールとして分類される場合もあります。Quarkus アプリケーションの重要なコンポーネントタイプの 1 つが、ランタイムとビルド時のアーティファクト、およびそれらの依存関係で構成される Quarkus エクステンションです。

source: While Quarkus itself does not use or enable usage of the Log4j core implementation library, it is always possible for an application built on Quarkus or any other general-purpose Java based framework to bypass the default provided logging facilities with custom code.
ja_jp: Quarkus自体はLog4jコア実装ライブラリを使用または有効にしませんが、Quarkusまたは他の汎用Javaベースのフレームワークで構築されたアプリケーションは、カスタムコードでデフォルトのログ機能を回避することが常に可能です。

source: While Quarkus will listen on port `8080` by default, when running tests it defaults to `8081`. This allows you to run tests while having the application running in parallel.
ja_jp: Quarkusはデフォルトではポート `8080` をリッスンしますが、テストを実行する場合はデフォルトで `8081` をリッスンします。 これにより、アプリケーションを並行して実行しながらテストを実行することができます。

source: While `@ConfigMapping` is the recommended approach, Quarkus also supports https://microprofile.io/project/eclipse/microprofile-config[MicroProfile Config] annotations to inject the configuration properties in the application.
ja_jp: `@ConfigMapping` が推奨されるアプローチですが、 Quarkus はアプリケーションに設定プロパティーをインジェクトするための https://microprofile.io/project/eclipse/microprofile-config[MicroProfile Config] アノテーションもサポートしています。

source: While `@Consumes` and `@Produces` are optional as auto-negotiation is supported, it is heavily recommended to annotate your endpoints with them to define precisely the expected content-types.
ja_jp: `@Consumes` と `@Produces` は自動ネゴシエーションがサポートされているためオプションですが、予想されるコンテンツタイプを正確に定義するため、エンドポイントにアノテーションを付けることを強く推奨します。

source: While `KafkaTransactions` provide a reactive API on top of Mutiny to manage Kafka transactions, you can still chain Kafka transactions with blocking Hibernate ORM transactions.
ja_jp: `KafkaTransactions` はKafkaトランザクションを管理するためにMutinyの上にリアクティブAPIを提供していますが、KafkaトランザクションをブロッキングHibernate ORMトランザクションとチェーンさせることができます。

source: While `PKCE` is of primary importance to the public OpenID Connect clients (such as the SPA scripts running in a browser), it can also provide an extra level of protection to Quarkus OIDC `web-app` applications which are confidential OpenID Connect clients capable of securely storing the client secret and using it to exchange the code for the tokens.
ja_jp: `PKCE` は公開 OpenID Connect クライアント (ブラウザーで動作する SPA スクリプトなど) にとって最も重要ですが、クライアントシークレットを安全に保存し、トークンのコード交換に使用できる機密 OpenID Connect クライアントである Quarkus OIDC `web-app` アプリケーションにも追加レベルの保護を提供することが可能です。

source: While `perf record` is running, open another window and access the endpoint:
ja_jp: `perf record` の実行中に、別のウィンドウを開き、エンドポイントにアクセスします。

source: While `quarkus.config-tracking.enabled` enables effective build time configuration report generation, there is also a way to check whether the values stored in that report have changed before the next build of the project is launched.
ja_jp: `quarkus.config-tracking.enabled` は効果的なビルド時設定レポートの生成を有効にしますが、プロジェクトの次のビルドが開始される前に、そのレポートに保存されている値が変更されたかどうかを確認する方法もあります。
